# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 1  # number of classes (for weed detection)
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10, 13, 16, 30, 33, 23]  # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

# Backbone with Conv_ECA
# Backbone
backbone:
  [
    [-1, 1, Conv_ECA, [64, 6, 2, 2, None, 1, True, 3]],
    [-1, 1, Conv_ECA, [128, 3, 2, None, 1, True, 3]],
    [-1, 3, C3, [128]],
    [-1, 1, Conv_ECA, [256, 3, 2, None, 1, True, 3]],
    [-1, 6, C3, [256]],
    [-1, 1, Conv_ECA, [512, 3, 2, None, 1, True, 3]],
    [-1, 9, C3, [512]],
    [-1, 1, CBAM, [512]],  # ✅ matches 512 output
    [-1, 1, Conv_ECA, [1024, 3, 2, None, 1, True, 3]],
    [-1, 3, C3, [1024]],
    [-1, 1, CBAM, [1024]], # ✅ matches 1024 output
    [-1, 1, BottleneckCSP, [1024, 1024, 1]],
    [-1, 1, SPPF, [1024, 5]],
  ]

# Head
head:
  [
    [-1, 1, GhostConv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],        # concat changes channels!
    [-1, 3, C3, [512, False]],
    [-1, 1, CBAM, [512]],             # ✅ matches C3 output

    [-1, 1, GhostConv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C3, [256, False]],
    [-1, 1, CBAM, [256]],             # ✅ matches C3 output

    [-1, 1, GhostConv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]],
    [-1, 3, C3, [512, False]],
    [-1, 1, CBAM, [512]],             # ✅ matches C3 output

    [-1, 1, GhostConv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]],
    [-1, 3, C3, [1024, False]],
    [-1, 1, CBAM, [1024]],            # ✅ matches C3 output

    [[17, 20, 23], 1, Detect, [nc, anchors]],
  ]
