# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 1  # number of classes (for weed detection)
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10, 13, 16, 30, 33, 23]  # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

# Backbone with Conv_ECA
backbone:
  [
    [-1, 1, Conv_ECA, [64, 6, 2, 2, None, 1, True, 3]],    # 0-P1/2
    [-1, 1, Conv_ECA, [128, 3, 2, None, 1, True, 3]],      # 1-P2/4
    [-1, 3, C3, [128]],                                    # 2
    [-1, 1, Conv_ECA, [256, 3, 2, None, 1, True, 3]],      # 3-P3/8
    [-1, 6, C3, [256]],                                    # 4
    [-1, 1, Conv_ECA, [512, 3, 2, None, 1, True, 3]],      # 5-P4/16
    [-1, 9, C3, [512]],                                    # 6
    [-1, 1, Conv_ECA, [1024, 3, 2, None, 1, True, 3]],     # 7-P5/32
    [-1, 3, C3, [1024]],                                   # 8
    [-1, 1, BottleneckCSP, [1024, 1024, 1]],               # ✅ INSERTED (index 9)
    [-1, 1, SPPF, [1024, 5]],                              # becomes index 10
  ]


# YOLOv5 head (unchanged)
head: [
    [-1, 1, GhostConv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, C3, [512, False]],

    [-1, 1, GhostConv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C3, [256, False]],

    [-1, 1, GhostConv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]],
    [-1, 3, C3, [512, False]],

    [-1, 1, GhostConv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]],
    [-1, 3, C3, [1024, False]],

    [[17, 20, 23], 1, Detect, [nc, anchors]],
]